; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v7 - type_2 ?v6 - type_1)
 	      (pred_1 ?v4 - object ?v6 - type_1)
	      (pred_3 ?v7 - type_2 ?v5 - type_3)
	      (pred_2 ?v7 - type_2 ?v4 - object ?v5 - type_3))

   (:action op_1
       :parameters  (?v7 - type_2 ?v8 ?v2 - type_1)
       :precondition (and  (pred_4 ?v7 ?v8))
       :effect (and  (pred_4 ?v7 ?v2)
		     (not (pred_4 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_2 ?v3 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v1) (pred_4 ?v7 ?v1) (pred_3 ?v7 ?v5))
       :effect (and (pred_2 ?v7 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v1)) 
		    (not (pred_3 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_2 ?v3 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v3 ?v5) (pred_4 ?v7 ?v1))
       :effect (and (pred_1 ?v3 ?v1)
		    (pred_3 ?v7 ?v5)
		    (not (pred_2 ?v7 ?v3 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_07 obj_01 - type_3
obj_03 obj_05 obj_08 - type_1
obj_04 obj_06 obj_09 - object)
(:init
(pred_4 obj_02 obj_03)
(pred_3 obj_02 obj_07)
(pred_3 obj_02 obj_01)
(pred_1 obj_04 obj_05)
(pred_1 obj_06 obj_05)
(pred_1 obj_09 obj_08)
)
(:goal
(and
(pred_1 obj_04 obj_03)
(pred_1 obj_06 obj_05)
(pred_1 obj_09 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_01))))
)
)

; plan
1. (op_1 obj_02 obj_03 obj_05)
   deleted: (pred_4 obj_02 obj_03)
   added: (pred_4 obj_02 obj_05)
   goals met: 2 of 3
2. (op_3 obj_02 obj_04 obj_05 obj_07)
   deleted: (pred_1 obj_04 obj_05) (pred_3 obj_02 obj_07)
   added: (pred_2 obj_02 obj_04 obj_07)
   goals met: 2 of 3
3. (op_1 obj_02 obj_05 obj_03)
   deleted: (pred_4 obj_02 obj_05)
   added: (pred_4 obj_02 obj_03)
   goals met: 2 of 3
4. (op_2 obj_02 obj_04 obj_03 obj_07)
   deleted: (pred_2 obj_02 obj_04 obj_07)
   added: (pred_1 obj_04 obj_03) (pred_3 obj_02 obj_07)
   goals met: 3 of 3
